app/Controllers/Admin/MenuManager.php

SELECT *
FROM `menu`
ORDER BY `id` DESC
---
    public function index()
    {
        $this->checkLogin();

        $data['title'] = 'Manage Menu';
        $data['menu'] = $this->db->table('menu')
            ->orderBy('id', 'DESC')
            ->get()
            ->getResultArray();