app/Controllers/Admin/Transaksi.php

    public function index()
    {
        $this->checkLogin();

        $data['title'] = 'Data Transaksi';
        $data['transaksi'] = $this->db->table('transaksi')
            ->orderBy('created_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `transaksi`
ORDER BY `created_at` DESC